Notes/daily/2022-01-17.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2022-01-17</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2022-01-17</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org179c1f4">Diary entry</a>
<ul>
<li><a href="#org9db5626">What have I done since the last entry?</a></li>
<li><a href="#org73414df">What have I learned &amp; how?</a></li>
<li><a href="#org604498d">What worked well?</a></li>
<li><a href="#org06508ad">What would I do differently next time?</a></li>
<li><a href="#org730fada">What are my plans next?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org179c1f4" class="outline-2">
<h2 id="org179c1f4">Diary entry</h2>
<div class="outline-text-2" id="text-org179c1f4">
</div>
<div id="outline-container-org9db5626" class="outline-3">
<h3 id="org9db5626">What have I done since the last entry?</h3>
<div class="outline-text-3" id="text-org9db5626">
<ul class="org-ul">
<li>I had my holidays 🎉</li>
<li>I continued working on getting a raspberry pi to boot with NixOS, unfortunately it seems to be a massive pain on aarch64; <i>this could be something to consider when deciding if we want to use it, perhaps something like debian with nixpkgs could be eaiser to install?</i></li>
<li>I <b><b>got a container booting from a nix config</b></b> (see <a href="../20220117103708-programming_log.html#ID-956c4043-ffaa-45d6-be32-6219c21ea597">programming log</a> for more details)</li>
</ul>
</div>
</div>
<div id="outline-container-org73414df" class="outline-3">
<h3 id="org73414df">What have I learned &amp; how?</h3>
<div class="outline-text-3" id="text-org73414df">
<ul class="org-ul">
<li>I've learned more about NixOS</li>
<li>I've researched more about containerd, it turns out <a href="https://mobyproject.org/">it isn't a project in isolation</a></li>
<li>I've learned more about writing Nix (the language)</li>
<li>I've learned a bit more go</li>
</ul>
</div>
</div>
<div id="outline-container-org604498d" class="outline-3">
<h3 id="org604498d">What worked well?</h3>
<div class="outline-text-3" id="text-org604498d">
<ul class="org-ul">
<li>Building the container went very smoothly, which was something I was quite worried about</li>
</ul>
</div>
</div>
<div id="outline-container-org06508ad" class="outline-3">
<h3 id="org06508ad">What would I do differently next time?</h3>
<div class="outline-text-3" id="text-org06508ad">
<ul class="org-ul">
<li>Next time I would rely a little bit more on tools such as <a href="https://cs.github.com">https://cs.github.com</a> earlier on</li>
</ul>
</div>
</div>
<div id="outline-container-org730fada" class="outline-3">
<h3 id="org730fada">What are my plans next?</h3>
<div class="outline-text-3" id="text-org730fada">
<ul class="org-ul">
<li>I need to get networking working on containers: at the moment they're not very useful as they can't, for example, install modules from NPM which is very important for javascript projects (see <a href="https://github.com/ClicksMinutePer/process-manager/blob/5d071af3aea89548f22ff8ddaee9a9901e3155eb/containerManager/config/mini-test/6.nix">here for my .nix file for this container</a> and <a href="https://github.com/Minion3665/container/blob/69dddbe54e0d563440146eabe4a11664921081a2/package.json#L8">here for the script it tries to run</a>). Note particularly that 'npm install' requires internet. A lack of internet is also problematic for running discord bots, as they need to contact discord in order to run. It is unclear if servers that did not contact the outside internet would be affected, as there <i>is</i> an option to forward ports but I have not yet tested it</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
